reddit_clone/app/controllers/application_controller.rb

    def current_user
        User.find_by(session: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "7Q-T4MuwEpW7AooW2gt1PQ"], ["LIMIT", 1]]