reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "content", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["content", "gjkg"], ["post_id", 3], ["created_at", "2019-02-05 23:11:13.371091"], ["updated_at", "2019-02-05 23:11:13.371091"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save