reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "sub_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "new"], ["content", "post"], ["sub_id", 1], ["user_id", 2]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2 WHERE "posts"."id" = $3  [["title", "EDITED new"], ["content", "EDITED post2"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    if @post.user_id == current_user.id
      @post.update_attributes(post_params)