reddit_clone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "newsub"], ["description", "sub about new stuff"], ["user_id", 2], ["created_at", "2019-02-05 22:06:00.205352"], ["updated_at", "2019-02-05 22:06:00.205352"]]

  def update
    @sub = Sub.find(params[:id])
    if @sub.user_id == current_user.id
      @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "EDITED newsub"], ["description", "EDITED sub about new stuff"], ["updated_at", "2019-02-05 22:36:04.080200"], ["id", 1]]