reddit_clone/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.id == current_user.id
      @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "username1"], ["password_digest", "$2a$10$waiVBSSIUtLfW1bSNlIvK.b33XUjyTq1Wy07NKOHLAo1gljsP4S3O"], ["updated_at", "2019-02-05 21:43:48.297451"], ["id", 2]]